app/views/admin/training_sessions/_form.html.erb

    <%= f.label :training_class_id, "Which class are you creating the session for?" %>
    <%= f.collection_select :training_class_id, TrainingClass.all, :id, :name, class: 'form-control' %>
---
SELECT "training_classes".* FROM "training_classes"

    <%= f.label :instructor_id, "Lead Instructor" %>
    <%= f.collection_select :instructor_id, Instructor.all, :id, :full_name, prompt: 'Select an Instructor' %>
---
SELECT "instructors".* FROM "instructors"