app/views/admin/training_sessions/index.html.erb

SELECT COUNT(*) FROM "user_training_sessions"  WHERE "user_training_sessions"."training_session_id" = ?  [["training_session_id", 1]]
---
                  <div class='col-md-5'>
                  	<p class='lead orange'><%= pluralize(x.user_training_sessions.count, 'attendee') %> <%= link_to 'View All', admin_training_session_url(x), class: 'btn btn-gtr-green btn-xs' %></p>