app/views/admin/master_reservations/index.html.erb

              <%= r.day %><br>
              <% r.reservations.each do |x| %>
---
SELECT "reservations".* FROM "reservations"  WHERE (day = '2015-08-19')  ORDER BY reservation_time asc