app/views/user_mailer/payment_confirmation.html.erb

                                    <p><b>Payment ID:</b> <%= @payment.id %></p>
                                    <p><b>Payment Date:</b> <%= @payment.created_at.strftime("%m/%d/%y") %></p>
---
INSERT INTO "payments" ("amount", "card_brand", "card_last_4", "charge_token", "created_at", "description", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)