app/views/user_mailer/reservation_email.html.erb

SELECT  "reservations".* FROM "reservations"  WHERE "reservations"."master_reservation_id" = ?  ORDER BY "reservations"."id" ASC LIMIT 1  [["master_reservation_id", 4]]
---
                                      <b>Time(s) Reserved:</b><br>
                                       <% @master_reservation.reservations.each do |reservation| %>