app/controllers/admin/events_controller.rb

  def create
    @event = Event.new(event_params)
    if @event.save
---
INSERT INTO "events" ("description", "event_end_date", "event_end_time", "event_start_date", "event_start_time", "title") VALUES (?, ?, ?, ?, ?, ?)

  def index
    @events = Event.order('event_start_date asc')
---
SELECT "events".* FROM "events"   ORDER BY event_start_date asc