app/controllers/admin/gun_ranges_controller.rb

  def edit
    @gun_range = GunRange.find(params[:id])
---
SELECT  "gun_ranges".* FROM "gun_ranges"  WHERE "gun_ranges"."id" = ? LIMIT 1  [["id", 1]]

  def select_range
    @gun_ranges = GunRange.all
---
SELECT "gun_ranges".* FROM "gun_ranges"

  def calendar
    @gun_range = GunRange.find(params[:gun_range_id])
---
SELECT  "gun_ranges".* FROM "gun_ranges"  WHERE "gun_ranges"."id" = ? LIMIT 1  [["id", 1]]

  def index
    @gun_ranges = GunRange.all
---
SELECT "gun_ranges".* FROM "gun_ranges"

  def create
    @gun_range = GunRange.new(gun_range_params)
    respond_to do |format|
      if @gun_range.save
---
INSERT INTO "gun_ranges" ("name") VALUES (?)  [["name", "1"]]

  def update
    @gun_range = GunRange.find(params[:id])
---
SELECT  "gun_ranges".* FROM "gun_ranges"  WHERE "gun_ranges"."id" = ? LIMIT 1  [["id", 1]]

  def show
    @gun_range = GunRange.find(params[:id])
    @lanes = @gun_range.lanes.order('number asc')
---
SELECT  "gun_ranges".* FROM "gun_ranges"  WHERE "gun_ranges"."id" = ? LIMIT 1  [["id", 1]]
SELECT "lanes".* FROM "lanes"  WHERE "lanes"."gun_range_id" = ?  ORDER BY number asc  [["gun_range_id", 1]]