app/controllers/admin/homepage_videos_controller.rb

SELECT  "homepage_videos".* FROM "homepage_videos"  WHERE "homepage_videos"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "homepage_videos" SET "url" = ? WHERE "homepage_videos"."id" = 1  [["url", "https://www.youtube.com/embed/Dl3QzFAqbKE?rel=0&amp;showinfo=0"]]
---
  def update
    @homepage_video = HomepageVideo.find(params[:id])
    url = params[:homepage_video][:url]
    url = url.gsub('watch?v=', 'embed/')
    url = url + "?rel=0&amp;showinfo=0"
    @homepage_video.url = url

    respond_to do |format|
      if @homepage_video.save