app/controllers/admin/instructors_controller.rb

  def create
    @instructor = Instructor.new(instructor_params)

    respond_to do |format|
      if @instructor.save
---
INSERT INTO "instructors" ("bio", "email", "first_name", "image", "last_name") VALUES (?, ?, ?, ?, ?)  [["bio", "IM so good."], ["email", "philis@example.com"], ["first_name", "Chad"], ["image", "IMG956318.jpg"], ["last_name", "Philis"]]

  def edit
    @instructor = Instructor.find(params[:id])
---
SELECT  "instructors".* FROM "instructors"  WHERE "instructors"."id" = ? LIMIT 1  [["id", 1]]

  def update
    @instructor = Instructor.find(params[:id])
    if params[:instructor][:remove_image].present?
      @instructor.remove_image!
    end
    respond_to do |format|
      if @instructor.update(instructor_params)
---
SELECT  "instructors".* FROM "instructors"  WHERE "instructors"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "instructors" SET "image" = ? WHERE "instructors"."id" = 1  [["image", nil]]

  def index
    @instructors = Instructor.all
---
SELECT "instructors".* FROM "instructors"