app/controllers/admin/lanes_controller.rb

  def new
    @gun_range = GunRange.find(params[:gun_range_id])
---
SELECT  "gun_ranges".* FROM "gun_ranges"  WHERE "gun_ranges"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @lane = Lane.new(lane_params)
    respond_to do |format|
      if @lane.save
---
INSERT INTO "lanes" ("gun_range_id", "number") VALUES (?, ?)  [["gun_range_id", 1], ["number", 1]]

  def show
    @gun_range = GunRange.find(params[:gun_range_id])
    @lane = Lane.find(params[:id])
---
SELECT  "gun_ranges".* FROM "gun_ranges"  WHERE "gun_ranges"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "lanes".* FROM "lanes"  WHERE "lanes"."id" = ? LIMIT 1  [["id", 1]]