app/controllers/admin/master_reservations_controller.rb

  def index
    if params[:date].present?
      reservations = Reservation.for_date(params[:date])
      @day = params[:date].to_date.strftime("%m/%d/%y")

    else
      reservations = Reservation.today.order('reservation_time asc')
---
SELECT "reservations".* FROM "reservations"  WHERE (day = '2015-08-19')  ORDER BY reservation_time asc