app/controllers/admin/memberships_controller.rb

  def edit
    @membership = Membership.find(params[:id])
---
SELECT  "memberships".* FROM "memberships"  WHERE "memberships"."id" = ? LIMIT 1  [["id", 2]]

  def index
    @memberships = Membership.all
---
SELECT "memberships".* FROM "memberships"

  def update
    @membership = Membership.find(params[:id])
    if @membership.update(membership_params)
---
SELECT  "memberships".* FROM "memberships"  WHERE "memberships"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "memberships" SET "annual_price" = ? WHERE "memberships"."id" = 2  [["annual_price", 750.4]]