app/controllers/admin/pages_controller.rb

SELECT  "users".* FROM "users"  WHERE (membership_id is not null) AND (lower(first_name) like '%kuhn%' or lower(last_name) like '%kuhn%') LIMIT 1 OFFSET 0
SELECT COUNT(*) FROM "users"  WHERE (membership_id is not null) AND (lower(first_name) like '%kuhn%' or lower(last_name) like '%kuhn%')
---
  def member_list
    if params[:search]
      @members = User.members.where('lower(first_name) like ? or lower(last_name) like ?', "%#{params[:search].downcase}%", "%#{params[:search].downcase}%")
      @members = @members.paginate(page: params[:page], per_page: 50)

SELECT  "homepage_videos".* FROM "homepage_videos"   ORDER BY "homepage_videos"."id" ASC LIMIT 1
---
  def homepage_video
    @homepage_video = HomepageVideo.first

SELECT  "gun_ranges".* FROM "gun_ranges"  WHERE "gun_ranges"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "lanes".* FROM "lanes"  WHERE "lanes"."id" = ? LIMIT 1  [["id", 1]]
---
  def create_reservation
    @master_reservation = MasterReservation.new
    @gun_range = GunRange.find(params[:gun_range_id])
    @lane = Lane.find(params[:lane_id])