app/controllers/admin/training_sessions_controller.rb

INSERT INTO "training_sessions" ("created_at", "end_time", "instructor_id", "session_date", "start_time", "training_class_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @training_session = TrainingSession.new(training_session_params)

    respond_to do |format|
      if @training_session.save

SELECT "training_sessions".* FROM "training_sessions"   ORDER BY "training_sessions"."session_date" ASC
---
  def index
    @training_sessions = TrainingSession.order(:session_date)