app/controllers/admin/training_classes_controller.rb

  def edit
    @training_class = TrainingClass.find(params[:id])
---
SELECT  "training_classes".* FROM "training_classes"  WHERE "training_classes"."id" = ? LIMIT 1  [["id", 1]]

  def update
    @training_class = TrainingClass.find(params[:id])
    respond_to do |format|
      if @training_class.update(training_class_params)
---
SELECT  "training_classes".* FROM "training_classes"  WHERE "training_classes"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "training_classes" SET "price" = ?, "updated_at" = ? WHERE "training_classes"."id" = 1  [["price", 450.5], ["updated_at", "2015-08-18 22:34:27.470482"]]

  def create
    @training_class = TrainingClass.new(training_class_params)

    respond_to do |format|
      if @training_class.save
---
INSERT INTO "training_classes" ("ammo_requirement", "created_at", "credential_requirement", "description", "equipment_requirement", "name", "price", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def destroy
    @training_class = TrainingClass.find(params[:id])
    @training_class.destroy
---
SELECT  "training_classes".* FROM "training_classes"  WHERE "training_classes"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "training_classes" WHERE "training_classes"."id" = ?  [["id", 1]]

  def index
    @training_classes = TrainingClass.all
---
SELECT "training_classes".* FROM "training_classes"