app/controllers/admin/users_controller.rb

  def update
    @user = User.find(params[:id])
    respond_to do |format|
      if @user.update(user_params)
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = 1  ORDER BY "users"."id" ASC LIMIT 1
UPDATE "users" SET "phone" = ?, "state" = ?, "updated_at" = ? WHERE "users"."id" = 2  [["phone", ""], ["state", "AL"], ["updated_at", "2015-08-19 11:54:34.025348"]]

	def create
    @user = User.new(user_params)

      @user.password = loop do
        random_token = SecureRandom.urlsafe_base64(nil, false)
        break random_token unless User.exists?(encrypted_password: random_token)
      end

    respond_to do |format|
      if @user.save
---
SELECT  1 AS one FROM "users"  WHERE "users"."encrypted_password" = 'jkiYBJsXdmSOo1xrJR4ohA' LIMIT 1
INSERT INTO "users" ("address1", "address2", "city", "created_at", "email", "encrypted_password", "first_name", "foid_or_license", "guests_left", "hours_available", "last_name", "membership_id", "phone", "state", "updated_at", "zip") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def index
  	if params[:term]
    	@users = User.where("lower(last_name) like ?", "%#{params[:term].downcase}%")
    	render json: @users.map{|u| "#{u.full_name} - #{u.email}"}
    elsif params[:search]
      @users = User.where('lower(first_name) like ? or lower(last_name) like ?', "%#{params[:search].downcase}%", "%#{params[:search].downcase}%")
      @users = @users.paginate(page: params[:page], per_page: 50)
---
SELECT  "users".* FROM "users"  WHERE (lower(first_name) like '%col%' or lower(last_name) like '%col%') LIMIT 50 OFFSET 0
SELECT  "users".* FROM "users"   ORDER BY last_name asc LIMIT 1 OFFSET 0
SELECT COUNT(*) FROM "users"