app/views/users/_user_sidebar.html.erb

SELECT  "memberships".* FROM "memberships"  WHERE "memberships"."id" = ? LIMIT 1  [["id", 2]]
---
    <h3>
      <% if @user.membership.present? %>