app/views/training_sessions/_existing_card_training_payment.html.erb

SELECT  "memberships".* FROM "memberships"  WHERE "memberships"."id" = ? LIMIT 1  [["id", 2]]
---
      <h4 class='white'>Price: <span class='pull-right'><%= number_to_currency(@training_session.training_class.price) %></span></h4>
      <% if current_user.membership.present? %>

SELECT  "deluxe_packages".* FROM "deluxe_packages"  WHERE "deluxe_packages"."training_class_id" = ? LIMIT 1  [["training_class_id", 1]]
---
      <% end %>
      <% if @training_session.training_class.deluxe_package.present? %>