app/views/training_sessions/show.html.erb


        <% if @training_session.training_class.deluxe_package.present? %>
---
SELECT  "deluxe_packages".* FROM "deluxe_packages"  WHERE "deluxe_packages"."training_class_id" = ? LIMIT 1  [["training_class_id", 1]]