app/controllers/gun_ranges_controller.rb

SELECT  "gun_ranges".* FROM "gun_ranges"  WHERE "gun_ranges"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @gun_range = GunRange.find(params[:id])

SELECT "gun_ranges".* FROM "gun_ranges"
---
  def index
    @gun_ranges = GunRange.all

SELECT  "gun_ranges".* FROM "gun_ranges"  WHERE "gun_ranges"."id" = ? LIMIT 1  [["id", 1]]
---
  def calendar
    @gun_range = GunRange.find(params[:gun_range_id])