app/controllers/lanes_controller.rb

  def show
    @gun_range = GunRange.find(params[:gun_range_id])
    @lane = Lane.find(params[:id])
---
SELECT  "gun_ranges".* FROM "gun_ranges"  WHERE "gun_ranges"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "lanes".* FROM "lanes"  WHERE "lanes"."id" = ? LIMIT 1  [["id", 2]]