app/controllers/pages_controller.rb

SELECT "events".* FROM "events"  WHERE (event_start_date is not null AND event_start_date >= '2015-08-20')  ORDER BY event_start_date asc
---
  def events
    @events = Event.future.order('event_start_date asc')

SELECT  "memberships".* FROM "memberships"  WHERE "memberships"."name" = 'Platinum' LIMIT 1
---
  def apply
    @membership = Membership.find_by_name(params[:membership])

SELECT  "homepage_videos".* FROM "homepage_videos"   ORDER BY "homepage_videos"."id" ASC LIMIT 1
---
  def welcome
    @url = HomepageVideo.first.url if HomepageVideo.first.present?

SELECT "memberships".* FROM "memberships"
---
  def about
    @memberships = Membership.all