app/controllers/payments_controller.rb

  def create
    @payment = Payment.new(payment_params)
    @timeslots = params[:timeslots].split(" ") if params[:timeslots]
    @date = params[:date] if params[:date]
    @gun_range = GunRange.find(params[:gun_range_id]) if params[:gun_range_id]
    @lane = Lane.find(params[:lane_id]) if params[:lane_id]
    @training_session = TrainingSession.find(params[:training_session_id]) if params[:training_session_id]
    #add deluxe package price if selected
    @payment.amount += (@training_session.training_class.deluxe_package.price * 100) if params[:deluxe_package].present?
    @membership = Membership.find(params[:membership_id]) if params[:membership_id]
    @frequency = params[:frequency]
    @user = @payment.user



    respond_to do |format|
      if @training_session.present?
        if @payment.save_training_payment(@training_session)
---
SELECT  "memberships".* FROM "memberships"  WHERE "memberships"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "payments" ("amount", "card_brand", "card_last_4", "charge_token", "created_at", "description", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
UPDATE "users" SET "guests_left" = ?, "hours_available" = ?, "membership_expires_on" = ?, "membership_id" = ?, "membership_type" = ?, "updated_at" = ? WHERE "users"."id" = 2  [["guests_left", 8], ["hours_available", 30], ["membership_expires_on", "2016-08-19"], ["membership_id", 2], ["membership_type", "annual"], ["updated_at", "2015-08-19 11:37:20.794250"]]

        if @frequency == 'annual'
          if @payment.save_annual_membership_payment(@membership)
            @user.set_annual_membership(@membership)
            @user.create_subscription(@membership, @payment)
---
INSERT INTO "subscriptions" ("amount_paid", "created_at", "description", "expires_on", "membership_id", "payment_id", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)