app/controllers/reservations_controller.rb

  def confirm_reservation
    @user = current_user
    @payment = Payment.new
    @number_of_guests = params[:number_of_guests]
    @gun_range = GunRange.find(params[:gun_range_id])
    @lane = Lane.find(params[:lane_id])
    @date = params[:date].to_date if params[:date]
    @gun_type = params[:gun_type]

    if @gun_type == "Handgun"
      if @user.membership.present?
---
SELECT  "gun_ranges".* FROM "gun_ranges"  WHERE "gun_ranges"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "lanes".* FROM "lanes"  WHERE "lanes"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "memberships".* FROM "memberships"  WHERE "memberships"."id" = ? LIMIT 1  [["id", 2]]