app/controllers/training_sessions_controller.rb

  def index

  	@training_sessions = TrainingSession.current
  	@training_sessions = @training_sessions.sort_by{|ts| ts.session_date}
    @training_sessions = @training_sessions.group_by{|s| s.session_date}
---
SELECT "training_sessions".* FROM "training_sessions"  WHERE (session_date is not null AND session_date >= '2015-08-18')

  def show
  	@training_session = TrainingSession.find(params[:id])
---
SELECT  "training_sessions".* FROM "training_sessions"  WHERE "training_sessions"."id" = ? LIMIT 1  [["id", 1]]