app/controllers/user_training_sessions_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."id" = 1  ORDER BY "users"."id" ASC LIMIT 1
---
  def index
    @user = User.find(params[:user_id])