app/controllers/users_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."id" = 1  ORDER BY "users"."id" ASC LIMIT 1
SELECT  "gun_ranges".* FROM "gun_ranges"  WHERE "gun_ranges"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "lanes".* FROM "lanes"  WHERE "lanes"."id" = ? LIMIT 1  [["id", 2]]
INSERT INTO "reservations" ("day", "gun_range_id", "lane_id", "master_reservation_id", "reservation_time", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["day", "2015-10-24"], ["gun_range_id", 1], ["lane_id", 2], ["master_reservation_id", 4], ["reservation_time", "2015-10-23 08:00:00.000000"], ["user_id", 1]]
---
  def member_reservation
    @user = User.find(params[:user_id])
    @timeslots = params[:timeslots].split(" ")
    @date = params[:date]
    @number_of_guests = params[:number_of_guests]
    @gun_range = GunRange.find(params[:gun_range_id])
    @gun_type = (params[:gun_type])
    @hours_used = (params[:hours_used])
    @lane = Lane.find(params[:lane_id])
    respond_to do |format|
      if @user.create_member_reservation(@timeslots, @gun_type, @gun_range, @number_of_guests,@lane, @date, @hours_used)

SELECT  "users".* FROM "users"  WHERE "users"."id" = 1  ORDER BY "users"."id" ASC LIMIT 1
SELECT "reservations".* FROM "reservations"  WHERE "reservations"."user_id" = ?  ORDER BY day desc  [["user_id", 1]]
---
  def reservations
    @user = User.find(params[:user_id])
    @reservations = @user.reservations.order('day desc')

SELECT  "users".* FROM "users"  WHERE "users"."id" = 2  ORDER BY "users"."id" ASC LIMIT 1
---
  def waiver
    @user = User.find(params[:user_id])

UPDATE "users" SET "cell_phone" = ?, "state" = ?, "updated_at" = ?, "work_phone" = ? WHERE "users"."id" = 1  [["cell_phone", ""], ["state", "IL"], ["updated_at", "2015-10-23 11:32:46.407447"], ["work_phone", ""]]
---
  def update


    respond_to do |format|
      if @user.update(user_params)

SELECT  "users".* FROM "users"  WHERE "users"."id" = 1  ORDER BY "users"."id" ASC LIMIT 1
---
    def set_user
      logger.debug "set_user"
      @user = User.find_by_id(params[:id]) || User.find_by_id(params[:user_id])