app/controllers/waivers_controller.rb

INSERT INTO "waivers" ("address1", "address2", "city", "date_of_birth", "email", "first_name", "foid_or_license", "last_name", "state", "user_id", "zip") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @waiver = Waiver.new(waiver_params)
    respond_to do |format|
      if @waiver.save