app/views/admin/users/_form.html.erb

    <%= f.label :membership_id %>
    <%= f.collection_select :membership_id, Membership.all, :id, :name , prompt: 'Select Membership', class: 'form-control' %>
---
SELECT "memberships".* FROM "memberships"